In [12]:
import pandas as pd
from pathlib import Path

base = Path.cwd() 

df = pd.read_csv("birdclef-2023/train_metadata.csv")
df.head()

,primary_label,secondary_labels,type,latitude,longitude,scientific_name,common_name,author,license,rating,url,filename
0,abethr1,[],['song'],4.3906,38.2788,Turdus tephronotus,African Bare-eyed Thrush,Rolf A. de By,Creative Commons Attribution-NonCommercial-Sha...,4.0,https://www.xeno-canto.org/128013,abethr1/XC128013.ogg
1,abethr1,[],['call'],-2.9524,38.2921,Turdus tephronotus,African Bare-eyed Thrush,James Bradley,Creative Commons Attribution-NonCommercial-Sha...,3.5,https://www.xeno-canto.org/363501,abethr1/XC363501.ogg
2,abethr1,[],['song'],-2.9524,38.2921,Turdus tephronotus,African Bare-eyed Thrush,James Bradley,Creative Commons Attribution-NonCommercial-Sha...,3.5,https://www.xeno-canto.org/363502,abethr1/XC363502.ogg
3,abethr1,[],['song'],-2.9524,38.2921,Turdus tephronotus,African Bare-eyed Thrush,James Bradley,Creative Commons Attribution-NonCommercial-Sha...,5.0,https://www.xeno-canto.org/363503,abethr1/XC363503.ogg
4,abethr1,[],"['call', 'song']",-2.9524,38.2921,Turdus tephronotus,African Bare-eyed Thrush,James Bradley,Creative Commons Attribution-NonCommercial-Sha...,4.5,https://www.xeno-canto.org/363504,abethr1/XC363504.ogg

In [20]:
from eda import run_all_edas

from IPython.display import display

eda_tables = run_all_edas(df)
for name, table in eda_tables.items():
    print(f"=== {name} ===")
    display(table)

=== basic_overview ===

                    metric     value
0                     rows  16941.00
1                  columns     12.00
2                memory_mb     10.53
3    unique_primary_labels    264.00
4        unique_recordists   1082.00
5     geotagged_recordings  16714.00
6        percent_geotagged     98.66
7  duplicate_species_codes       NaN
8              rating_mean      3.73
9               rating_std      1.10

=== missingness ===

              column  missing  missing_pct
0           latitude      227         1.34
1          longitude      227         1.34
2      primary_label        0         0.00
3   secondary_labels        0         0.00
4               type        0         0.00
5    scientific_name        0         0.00
6        common_name        0         0.00
7             author        0         0.00
8            license        0         0.00
9             rating        0         0.00
10               url        0         0.00
11          filename        0         0.00

=== cardinality ===

              column    dtype  unique_values  unique_ratio
10               url   object          16941        1.0000
11          filename   object          16941        1.0000
4          longitude  float64           6301        0.3719
3           latitude  float64           6252        0.3690
7             author   object           1082        0.0639
2               type   object            796        0.0470
1   secondary_labels   object            751        0.0443
0      primary_label   object            264        0.0156
5    scientific_name   object            264        0.0156
6        common_name   object            264        0.0156
9             rating  float64             11        0.0006
8            license   object              4        0.0002

=== label_distribution ===

   primary_label  records  records_pct
0         barswa      500         2.95
1         wlwwar      500         2.95
2        thrnig1      500         2.95
3        eaywag1      500         2.95
4         comsan      500         2.95
5         woosan      486         2.87
6        combuz1      477         2.82
7        eubeat1      437         2.58
8         hoopoe      436         2.57
9        cohmar1      425         2.51
10        litegr      378         2.23
11       combul2      293         1.73
12       rbsrob1      281         1.66
13       blakit1      262         1.55
14        greegr      252         1.49
15       gnbcam2      239         1.41
16       rerswa1      227         1.34
17       somgre1      199         1.17
18       colsun2      181         1.07
19       ratcis1      172         1.02

=== recording_type_distribution ===

                                                  type  records  records_pct
0                                             ['song']     4102        24.21
1                                             ['call']     3987        23.53
2                                                 ['']     1776        10.48
3                                      ['flight call']     1139         6.72
4                                     ['call', 'song']      527         3.11
..                                                 ...      ...          ...
791                       ['aggressive calls', 'call']        1         0.01
792                          ['adult', 'duet', 'song']        1         0.01
793  ['adult', 'call', 'nocturnal flight call', 'se...        1         0.01
794  ['dawn song', 'life stage uncertain', 'male', ...        1         0.01
795                  ['demonstrative tapping', 'male']        1         0.01

[796 rows x 3 columns]

=== rating_distribution ===

    rating  records  records_pct
0      0.0      514         3.03
1      0.5       28         0.17
2      1.0      112         0.66
3      1.5      174         1.03
4      2.0      533         3.15
5      2.5      960         5.67
6      3.0     2314        13.66
7      3.5     2354        13.90
8      4.0     4895        28.89
9      4.5     1495         8.82
10     5.0     3562        21.03

=== rating_summary ===

  statistic      value
0     count  16941.000
1      mean      3.728
2       std      1.101
3       min      0.000
4       25%      3.000
5       50%      4.000
6       75%      4.500
7       max      5.000

=== author_activity ===

               author  records  records_pct
0        isaac kilusu     1144         6.75
1     Louis A. Hansen      846         4.99
2           Bram Piot      754         4.45
3       James Bradley      613         3.62
4      Lynette Rudman      610         3.60
5          Rory Nefdt      576         3.40
6         Tony Archer      547         3.23
7    Martin St-Michel      469         2.77
8    Albert Lastukhin      402         2.37
9   José Carlos Sires      378         2.23
10    Stanislas Wroza      332         1.96
11      Tim Cockcroft      322         1.90
12   Bernard BOUSQUET      214         1.26
13      Lars Lachmann      207         1.22
14        Anon Torimi      195         1.15
15      Rolf A. de By      186         1.10
16    Dawie de Swardt      163         0.96
17      Étienne Leroy      160         0.94
18    Stein Ø. Nilsen      158         0.93
19     Cedric Mroczko      148         0.87

=== license_distribution ===

                                             license  records  records_pct
0  Creative Commons Attribution-NonCommercial-Sha...    15512        91.56
1  Creative Commons Attribution-NonCommercial-Sha...     1330         7.85
2        Creative Commons Attribution-ShareAlike 4.0       94         0.55
3        Creative Commons Attribution-ShareAlike 3.0        5         0.03

=== geo_summary ===

             metric    value
0      latitude_min  -38.117
1   latitude_median    2.360
2      latitude_max   71.977
3     longitude_min -157.819
4  longitude_median   26.751
5     longitude_max  177.685

=== secondary_label_count_distribution ===

   secondary_label_count  records  records_pct
0                      0    14636        86.39
1                      1     1520         8.97
2                      2      564         3.33
3                      3      164         0.97
4                      4       39         0.23
5                      5       11         0.06
6                      6        4         0.02
7                      7        1         0.01
8                      8        1         0.01
9                      9        1         0.01

=== top_secondary_labels ===

   secondary_label  occurrences  occurrences_pct
0          combul2          349            10.27
1           rindov          200             5.88
2          somgre1          152             4.47
3          grbcam1          130             3.82
4          laudov1          100             2.94
5          reedov1           92             2.71
6          hadibi1           75             2.21
7           wlwwar           72             2.12
8          abhori1           70             2.06
9          eswdov1           69             2.03
10         piecro1           67             1.97
11         tafpri1           60             1.77
12         reftin1           59             1.74
13         ratcis1           56             1.65
14         yewgre1           55             1.62
15          barswa           49             1.44
16         yertin1           47             1.38
17         reccuc1           47             1.38
18         trobou1           47             1.38
19         wbswea1           46             1.35